IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/EPWM1_EPWM.xml
	<register id="EPWM_REGS_TZSEL" acronym="EPWM_REGS_TZSEL" offset="0x24" width="16" description="Trip Zone Select Register">
		<bitfield id="OSHTN" width="8" begin="15" end="8" resetval="0x0" description="Trip-zone n [TZn] select One-Shot [OSHT] trip-zone enable/disable When any of the enabled pins go low, a one-shot trip event occurs for this ePWM module When the event occurs, the action defined in the TZCTL register is taken on the EPWMxA and EPWMxB outputs The one-shot trip condition remains latched until you clear the condition via the TZCLR register" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="CBCN" width="8" begin="7" end="0" resetval="0x0" description="Trip-zone n [TZn] select Cycle-by-Cycle [CBC] trip-zone enable/disable When any of the enabled pins go low, a cycle-by-cycle trip event occurs for this ePWM module When the event occurs, the action defined in the TZCTL register is taken on the EPWMxA and EPWMxB outputs A cycle-by-cycle trip condition is automatically cleared when the time-base counter reaches zero" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TZCTL" acronym="EPWM_REGS_TZCTL" offset="0x28" width="16" description="Trip Zone Control Register">
		<bitfield id="TZB" width="2" begin="3" end="2" resetval="0x0" description="When a trip event occurs the following action is taken on output EPWMxB Which trip-zone pins can cause an event is defined in the TZSEL register" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="TZA" width="2" begin="1" end="0" resetval="0x0" description="When a trip event occurs the following action is taken on output EPWMxA Which trip-zone pins can cause an event is defined in the TZSEL register" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TZEINT" acronym="EPWM_REGS_TZEINT" offset="0x2A" width="16" description="Trip Zone Enable Interrupt Register">
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone One-Shot Interrupt Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Trip-zone Cycle-by-Cycle Interrupt Enable" range="1" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TZFLG" acronym="EPWM_REGS_TZFLG" offset="0x2C" width="16" description="Trip Zone Flag Register">
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Latched Status Flag for A One-Shot Trip Event" range="2" rwaccess="R"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Latched Status Flag for Cycle-By-Cycle Trip Event" range="1" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched Trip Interrupt Status Flag" range="0" rwaccess="R"/>
	</register>
	<register id="EPWM_REGS_TZCLR" acronym="EPWM_REGS_TZCLR" offset="0x2E" width="16" description="Trip Zone Clear Register">
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for One-Shot Trip [OST] Latch" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC] Trip Latch" range="1" rwaccess="R/W"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Clear Flag" range="0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_TZFRC" acronym="EPWM_REGS_TZFRC" offset="0x30" width="16" description="Trip Zone Force Register">
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Force a One-Shot Trip Event via Software" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Force a Cycle-by-Cycle Trip Event via Software" range="1" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_ETSEL" acronym="EPWM_REGS_ETSEL" offset="0x32" width="16" description="Event Trigger Selection Register">
		<bitfield id="INTEN" width="1" begin="3" end="3" resetval="0x0" description="Enable ePWM Interrupt [EPWMx_INT] Generation" range="3" rwaccess="R/W"/> 
		<bitfield id="INTSEL" width="3" begin="2" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Selection Options" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_ETPS" acronym="EPWM_REGS_ETPS" offset="0x34" width="16" description="Event Trigger Pre-Scale Register">
		<bitfield id="INTCNT" width="2" begin="3" end="2" resetval="0x0" description="ePWM Interrupt Event [EPWMx_INT] Counter Register These bits indicate how many selected ETSEL[INTSEL] events have occurred These bits are automatically cleared when an interrupt pulse is generated If interrupts are disabled, ETSEL[INT] = 0 or the interrupt flag is set, ETFLG[INT] = 1, the counter will stop counting events when it reaches the period value ETPS[INTCNT] = ETPS[INTPRD]" range="3 - 2" rwaccess="R"/> 
		<bitfield id="INTPRD" width="2" begin="1" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Period Select These bits determine how many selected ETSEL[INTSEL] events need to occur before an interrupt is generated To be generated, the interrupt must be enabled [ETSEL[INT] = 1] If the interrupt status flag is set from a previous interrupt [ETFLG[INT] = 1] then no interrupt will be generated until the flag is cleared via the ETCLR[INT] bit This allows for one interrupt to be pending while another is still being serviced Once the interrupt is generated, the ETPS[INTCNT] bits will automatically be cleared Writing a INTPRD value that is the same as the current counter value will trigger an interrupt if it is enabled and the status flag is clear Writing a INTPRD value that is less than the current counter value will result in an undefined state If a counter event occurs at the same instant as a new zero or non-zero INTPRD value is written, the counter is incremented" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_ETFLG" acronym="EPWM_REGS_ETFLG" offset="0x36" width="16" description="Event Trigger Flag Register">
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched ePWM Interrupt [EPWMx_INT] Status Flag" range="0" rwaccess="R"/>
	</register>
	<register id="EPWM_REGS_ETCLR" acronym="EPWM_REGS_ETCLR" offset="0x38" width="16" description="Event Trigger Clear Register">
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Flag Clear Bit" range="0" rwaccess="R"/>
	</register>
	<register id="EPWM_REGS_ETFRC" acronym="EPWM_REGS_ETFRC" offset="0x3A" width="16" description="Event Trigger Force Register">
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit The interrupt will only be generated if the event is enabled in the ETSEL register The INT flag bit will be set regardless" range="0" rwaccess="R"/>
	</register>
	<register id="EPWM_REGS_PCCTL" acronym="EPWM_REGS_PCCTL" offset="0x3C" width="16" description="PWM Chopper Control Register">
		<bitfield id="CHPDUTY" width="3" begin="10" end="8" resetval="0x0" description="Chopping Clock Duty Cycle" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="CHPFREQ" width="3" begin="7" end="5" resetval="0x0" description="Chopping Clock Frequency" range="7 - 5" rwaccess="R/W"/> 
		<bitfield id="OSHTWTH" width="4" begin="4" end="1" resetval="0x0" description="One-Shot Pulse Width" range="4 - 1" rwaccess="R/W"/> 
		<bitfield id="CHPEN" width="1" begin="0" end="0" resetval="0x0" description="PWM-chopping Enable" range="0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_PID" acronym="EPWM_REGS_PID" offset="0x5C" width="32" description="EHRPWM Peripheral ID Register. The IP revision register is used by software to track features, bugs, and compatibility.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish between the old scheme and current" range="31 - 30" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1233" description="FUNC" range="27 - 16" rwaccess="R"/> 
		<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x1" description="RTL version [R], maintained by IP design owner" range="15 - 11" rwaccess="R"/> 
		<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision [X]" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="CUSTOM" range="7 - 6" rwaccess="R"/> 
		<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision [Y]" range="5 - 0" rwaccess="R"/>
	</register>
</module>